package com.hiricus.dcs.util;

import org.springframework.stereotype.Component;

@Component
public class StandardResponseContainer {
    private final String response = "-Признаюсь братцы вам, i'm gay. АХХЫВХАЫХХЫВХАХ. Клянусь братцы вам, я дедушку бил.\n" +
            "-Так что же с дедушкой случилась за беда? Ведь у него было туда.\n" +
            "-Увы, деда получил палкой по спине. В пустом сарае тёмной ночью хуярил махорку я и думал о своём. Моя жена средь звёзд на тёмном пастбище блуждала, в пустом трактире наблевала. Затем за столом трактирщику дала. Он умер. Блять. Мааам!\n" +
            "Взглянул в окно, стал любоваться тёмной ночью и удивился: столетний дед резвился в поле. Дощь струился проливной.\n" +
            "-Так он же дебил. \n" +
            "-Клянусь дебил. Он хоть и строгий был, зато дебил. Так тут святое врезать палкой по спине. Не стало деда в округе теперь.\n" +
            "Курил махорку я, и затем силы зла на меня проклятье наложили. Раззар! Решив посрать конкретно, я вышел в непогоду. Сортир был слева, справа - лево, с прогибом трахтибедох был следом. Справа льсес стоял стеной. Я вошёл в пустой сортир. Курил махорку бля и думал о своём. Взглянул в окно: в пустом сортире сидел столетний дед. Он прохрипел из ануса выплёвывая воду.\n" +
            "-Я какаю тридцать лет... Я ещё только сел...\n" +
            "-РааРррр!\n" +
            "Он умер, мы его в сортире уложили. И утром я начал вам рассказывать о том, что силы зла ночью в штанишки наложили, прислав засранца к ним с рогами в сортире пустом.\n" +
            "Трактирщик умер.\n" +
            "Блять";

    public String getResponse() {
        return response;
    }
}
